Revit 2020 API
FamilySizeTableColumn Members
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FamilySizeTableColumn
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DisplayUnitType
 The Display unit type of the column.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The column name.
UnitType
 The Unit type of the column.
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace